/*
Создать приложение, в котором возможна работа с пользователями системы: удаление пользователя, перевод в другой статус,
добавление пользователя, редактирование, получение всех пользователей с их статусами и т.д
*/

public class Main {

  public static void main(String[] args) {

//    Example:
//    UserService userService;
//
//    List<User> allUsers = userService.getAllUsers();
//    for (User user: allUsers) {
//      System.out.println(user.getUsername());
//    }
  }

}
